CFD_results/long/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
80571
(
(0.0212335820543373 0.0220478317519134 0.672114608485121)
(-0.00594099877581845 -0.00607964446720111 0.640816069560413)
(0.00126319437170484 0.0292193593135031 0.682607055412759)
(-0.00823554681741791 -0.00492795504284271 0.709259401680894)
(-0.00421193281914904 -0.0044026792811644 0.691488593139315)
(-0.00427036794077073 -0.00517027115319677 0.691366171065697)
(-0.0021055162620981 -0.00480876792618888 0.686757120448988)
(0.0091697592757561 -0.00858055032617608 0.682306302534718)
...
)
;

boundaryField
{
    inlet
    {
        type            flowRateInletVelocity;
        volumetricFlowRate constant 3e-05;
        extrapolateProfile false;
        value           nonuniform List<vector> 
224
(
(-0 -0 0.682363940751452)
(-0 -0 0.682363940751452)
(-0 -0 0.682363940751452)
(-0 -0 0.682363940751452)
(-0 -0 0.682363940751452)
(-0 -0 0.682363940751452)
(-0 -0 0.682363940751452)
(-0 -0 0.682363940751452)
...
)
;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           nonuniform List<vector> 
576
(
(-0.0268194642052404 -0.166790239056544 -0.320741366154223)
(-0.00451259468757167 -0.165209361582136 -0.351265834803372)
(-0.022781387590708 -0.163535445276894 -0.308103721901147)
(-0.015712791965429 -0.178568043343961 -0.319291437105943)
(-0.00442301806053131 -0.175251979402895 -0.299569933119777)
(0.0253375271257298 -0.159610128655986 -0.328010331811326)
(0.0186699327819201 -0.189544536985359 -0.321302491472466)
(0.033336261395301 -0.153328051582482 -0.324974417097908)
...
)
;
    }
    wall
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
