CFD_results/long/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
229450
(
1.20353851057327e-07
-4.58276820208445e-09
-4.72115988403896e-09
-1.06429863378332e-07
-2.35133426363834e-09
-2.26823673001335e-09
-8.63026777431881e-08
-8.60139035790706e-08
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
224
(
-5.04880130138639e-08
-5.04971110968088e-08
-5.12881853597541e-08
-3.59699578925279e-08
-1.04283546717835e-07
-4.73736193772871e-08
-3.97751011666909e-08
-1.47993487958601e-07
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
576
(
1.55270622792476e-08
9.43004640079131e-09
2.57307410050358e-08
2.30039672595712e-08
7.11726607763857e-08
1.42409105142168e-08
2.0827431801675e-08
3.66317041727059e-08
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform -0;
    }
}


// ************************************************************************* //
